In [1]:
import unicodecsv
import pandas as pd
#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [2]:
user = read_csv('../data_20180120/customer.csv')

In [3]:
users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [4]:
len(users)

36212

# คัดเอาis nullออก

In [6]:
import locale
locale.setlocale(locale.LC_ALL, '') 

neww_users = users[:]

neww_users['CUSTOMER_ID'] = users['CUSTOMER_ID'].apply(locale.atoi)
neww_users_birth = neww_users[neww_users['DATE_OF_BIRTH'].notnull() & (neww_users['DATE_OF_BIRTH'] != "")]

neww_users_birth[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,2083,ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
13,2390,ภิญญามาศ,N,1100700539,770/73,10250,01010000000,กรุงเทพมหานคร,ถ.พัฒนาการ,01011230000,แขวงสวนหลวง,01011230120,เขตสวนหลวง,HOUSE,หมู่บ้านพาทิโอ,,1986-8-11
16,2406,พัชรา,N,1100698992,ห้อง55/56,10150,01010000000,กรุงเทพมหานคร,ราชพฤกษ์,01010870000,แขวงบางค้อ,01010870055,เขตจอมทอง,CONDOMINIUM,คอนโดIdeo วุฒากาศ,บล.หลักทรัพย์ฟิลลิป,1983-10-10
21,2412,ณภัทร,N,1100463792,164/316,11110,01240000000,จ.นนทบุรี,บางกรวย-ไทรน้อย,01244250000,ต.พิมลราช,01244254131,อ.บางบัวทอง,HOUSE,,,1989-10-25
22,2413,ทวีศักดิ์,N,1100694276,320/144 (ตึก A ห้อง 1009),11000,01240000000,จ.นนทบุรี,รัตนาธิเบศร์,01246240000,ต.บางกระสอ,01246243042,อ.เมืองนนทบุรี,CONDOMINIUM,ลุมพินีพาร์ค รัตนาธิเบศร์-งามวงศ์วาน,,1982-6-4

# customer ที่ไม่ได้filter

In [7]:
df_age_null = users['DATE_OF_BIRTH']
df_age_null[:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [8]:
date_null = pd.DataFrame(df_age_null)
date_null[:4]

  DATE_OF_BIRTH
0    1988-10-30
1
2
3

In [9]:
from datetime import datetime

def bd_to_age(bd_str):
    if  (bd_str != ""):
        datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
        now = datetime.now().date()
        delta = (now - datetime_ob)
        number_of_days = delta.days
        number_of_years = number_of_days/365
        return number_of_years
    else:
        return None

In [10]:
bd_to_age('1988-10-30')

29.36986301369863

In [11]:
age_null = date_null['DATE_OF_BIRTH'].apply(bd_to_age)
age_null[:5]

0    29.369863
1          NaN
2          NaN
3          NaN
4          NaN
Name: DATE_OF_BIRTH, dtype: float64

# รวม id age address

In [12]:
customer = neww_users_birth['CUSTOMER_ID']
address = neww_users_birth['ADDRESS_POSTAL_CODE']
date = neww_users_birth['DATE_OF_BIRTH']


new_users = pd.concat([customer,address,date], axis=1)
new_users[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083               20170    1988-10-30
13         2390               10250     1986-8-11
16         2406               10150    1983-10-10
21         2412               11110    1989-10-25
22         2413               11000      1982-6-4

In [13]:
new_users.isnull().sum()

CUSTOMER_ID            0
ADDRESS_POSTAL_CODE    0
DATE_OF_BIRTH          0
dtype: int64

In [14]:
new_users.dtypes

CUSTOMER_ID             int64
ADDRESS_POSTAL_CODE    object
DATE_OF_BIRTH          object
dtype: object

# address isnull

In [15]:
new_users = new_users.convert_objects(convert_numeric=True)

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

In [16]:
new_users.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE    float64
DATE_OF_BIRTH           object
dtype: object

In [17]:
address_only = users['ADDRESS_POSTAL_CODE']
address_only[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [18]:
df_address = pd.DataFrame(address_only ,columns=['ADDRESS_POSTAL_CODE'])
df_address[:5]

  ADDRESS_POSTAL_CODE
0               20170
1
2
3
4

# check null

In [19]:
pd.isnull(df_address).sum()>0

ADDRESS_POSTAL_CODE    False
dtype: bool

# เอา empty ออกจาก address

In [20]:
df_address = pd.DataFrame(address_only ,columns=['ADDRESS_POSTAL_CODE'])
df_address[:5].convert_objects(convert_numeric=True)[:4]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.

   ADDRESS_POSTAL_CODE
0              20170.0
1                  NaN
2                  NaN
3                  NaN

In [21]:
address2 = df_address.convert_objects(convert_numeric=True).dropna()
address2[:5]

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

    ADDRESS_POSTAL_CODE
0               20170.0
9               11120.0
10              10210.0
13              10250.0
16              10150.0

# รวมแถว customer กับ address

In [22]:
id_address = pd.concat([customer,address2], axis=1)
id_address[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
9           NaN              11120.0
10          NaN              10210.0
13       2390.0              10250.0
16       2406.0              10150.0

# ตัด null ออก

In [23]:
 id_notnull = id_address[id_address['CUSTOMER_ID'].notnull()&(id_address['ADDRESS_POSTAL_CODE'].notnull())]
id_notnull[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0        2083.0              20170.0
13       2390.0              10250.0
16       2406.0              10150.0
21       2412.0              11110.0
22       2413.0              11000.0

In [24]:
id_notnull.dtypes

CUSTOMER_ID            float64
ADDRESS_POSTAL_CODE    float64
dtype: object

# เปลี่ยน address ให้เป็น int

In [25]:
import numpy as np
cols = ['CUSTOMER_ID', 'ADDRESS_POSTAL_CODE']
id_notnull[cols] = id_notnull[cols].applymap(np.int64)
id_notnull[:5]

C:\Users\User\Anaconda3\lib\site-packages\pandas\core\frame.py:2352: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE
0          2083                20170
13         2390                10250
16         2406                10150
21         2412                11110
22         2413                11000

In [26]:
id_notnull.dtypes

CUSTOMER_ID            int64
ADDRESS_POSTAL_CODE    int64
dtype: object

In [27]:
len(id_notnull)

10276

In [28]:
pd.isnull(id_notnull).sum()>0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
dtype: bool

In [29]:
id_notnull.to_csv('../data_clean/customer_address.csv', index = False)

# export customer

In [30]:
df_add =id_notnull['ADDRESS_POSTAL_CODE']
df_add[:5]

0     20170
13    10250
16    10150
21    11110
22    11000
Name: ADDRESS_POSTAL_CODE, dtype: int64

In [31]:
id_x = neww_users['CUSTOMER_ID']
df_customer= pd.DataFrame(id_x)

In [32]:
id_age = pd.concat([df_customer,age_null], axis=1)
id_age[:5]

   CUSTOMER_ID  DATE_OF_BIRTH
0         2083      29.369863
1         2102            NaN
2         2223            NaN
3         2224            NaN
4         2284            NaN

In [33]:
id_add = pd.concat([df_customer,df_add], axis=1)
id_add[:5]

   CUSTOMER_ID  ADDRESS_POSTAL_CODE
0         2083              20170.0
1         2102                  NaN
2         2223                  NaN
3         2224                  NaN
4         2284                  NaN

# ตารางที่มี id + age(isnull) + address(isnull)

In [34]:
table_isnull_age = id_age[id_age['DATE_OF_BIRTH'].isnull()]
table_isnull_age[:5]

   CUSTOMER_ID  DATE_OF_BIRTH
1         2102            NaN
2         2223            NaN
3         2224            NaN
4         2284            NaN
5         2285            NaN

In [35]:
table_isnull_address =id_add[id_add['ADDRESS_POSTAL_CODE'].isnull()]
table_isnull_address[:5]

   CUSTOMER_ID  ADDRESS_POSTAL_CODE
1         2102                  NaN
2         2223                  NaN
3         2224                  NaN
4         2284                  NaN
5         2285                  NaN

In [36]:
table_isnull_age.to_csv('../data_clean/customer_isnull_age.csv', index = False)

In [37]:
table_isnull_address.to_csv('../data_clean/customer_isnull_address.csv', index = False)

# Age

In [65]:
len(id_notnull)

10276

In [66]:
new_users.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE    float64
DATE_OF_BIRTH           object
dtype: object

In [67]:
new_users[:5]

    CUSTOMER_ID  ADDRESS_POSTAL_CODE DATE_OF_BIRTH
0          2083              20170.0    1988-10-30
13         2390              10250.0     1986-8-11
16         2406              10150.0    1983-10-10
21         2412              11110.0    1989-10-25
22         2413              11000.0      1982-6-4

# Convert date to age

In [68]:
y_m_d = new_users['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [69]:

from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 19, 11, 29, 34, 734893)

In [70]:
 y = now.year
y

2018

In [71]:
 y- int('1988')

30

In [72]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [73]:
bd_to_age('1988-10-30')

29.326027397260273

# Age

In [74]:
 age_dirt = new_users['DATE_OF_BIRTH'].apply(bd_to_age)
age_dirt[:5]

0     29.326027
13    31.547945
16    34.386301
21    28.339726
22    35.736986
Name: DATE_OF_BIRTH, dtype: float64

In [75]:
len(age_dirt)

10594

# รวมแถวที่มี id&address&date

In [76]:
users_all = pd.concat([customer,address,age_dirt], axis=1)
users_all[:10]

    CUSTOMER_ID ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0          2083               20170      29.326027
13         2390               10250      31.547945
16         2406               10150      34.386301
21         2412               11110      28.339726
22         2413               11000      35.736986
24         2416               10280      35.890411
26         2082               11120      41.353425
27         2142               10140      29.547945
32         2291               12130      33.632877
36         2316               10250      22.605479

In [77]:
pd.isnull(users_all).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
DATE_OF_BIRTH          False
dtype: bool

In [78]:
users_all['Age'] = age_dirt
users_all[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE  DATE_OF_BIRTH        Age
0          2083               20170      29.326027  29.326027
13         2390               10250      31.547945  31.547945
16         2406               10150      34.386301  34.386301
21         2412               11110      28.339726  28.339726
22         2413               11000      35.736986  35.736986

# ลบแถวDATE_OF_BIRTH

In [79]:
del users_all['DATE_OF_BIRTH']

users_all[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0          2083               20170  29.326027
13         2390               10250  31.547945
16         2406               10150  34.386301
21         2412               11110  28.339726
22         2413               11000  35.736986

In [80]:
len(users_all)

10594

# check max of age

In [81]:
users_all.loc[users_all['Age'].idxmax()]

CUSTOMER_ID              55624
ADDRESS_POSTAL_CODE      11110
Age                    2017.47
Name: 9726, dtype: object

# กำหนดเอาค่าอายุระหว่าง0 ถึง 122ปี

In [82]:
users_clean = users_all[users_all['CUSTOMER_ID'].notnull() & (users_all['ADDRESS_POSTAL_CODE'].notnull() )& (users_all['Age'] <= 122) &(users_all['Age'] >= 0)]

users_clean[:5]

    CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0          2083               20170  29.326027
13         2390               10250  31.547945
16         2406               10150  34.386301
21         2412               11110  28.339726
22         2413               11000  35.736986

In [83]:
users_all.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

# ดังนั้นข้อมูลที่cleanทั้งหมดมี 10,541

In [84]:
len(users_clean )

10541

In [85]:
len(users_all)

10594

In [86]:
users_clean.dtypes

CUSTOMER_ID              int64
ADDRESS_POSTAL_CODE     object
Age                    float64
dtype: object

In [87]:
pd.isnull(users_clean).sum() > 0

CUSTOMER_ID            False
ADDRESS_POSTAL_CODE    False
Age                    False
dtype: bool

In [88]:
age_array=users_clean.as_matrix(columns=users_clean.columns[2:])  
age_array

array([[ 29.3260274 ],
       [ 31.54794521],
       [ 34.38630137],
       ...,
       [ 48.11232877],
       [ 29.92876712],
       [ 30.10136986]])

# check max min

In [89]:
users_clean.loc[users_clean['Age'].idxmax()]

CUSTOMER_ID             175004
ADDRESS_POSTAL_CODE
Age                    117.992
Name: 30161, dtype: object

In [90]:
users_clean.loc[users_clean['Age'].idxmin()]

CUSTOMER_ID              186282
ADDRESS_POSTAL_CODE       10110
Age                    0.134247
Name: 31810, dtype: object

# mean

In [91]:
import numpy as np

mean= np.mean(age_array)
mean

34.415869670029494

In [92]:
sd = np.std(age_array)
sd

9.9571972855965463